grevaillot/svd_tools/headers/STM32H7x7_CM7/tim8.h
#pragma once 

/* --- TIM8: Advanced-timers ---------------------------------------- */

/** @defgroup tim8_registers Advanced-timers Register
@{*/

/** TIM8_CR1 control register 1 **/
#define TIM8_CR1			MMIO32(TIM8_BASE + 0x00)
/** TIM8_CR2 control register 2 **/
#define TIM8_CR2			MMIO32(TIM8_BASE + 0x04)
/** TIM8_SMCR slave mode control register **/
#define TIM8_SMCR			MMIO32(TIM8_BASE + 0x08)
/** TIM8_DIER DMA/Interrupt enable register **/
#define TIM8_DIER			MMIO32(TIM8_BASE + 0x0c)
/** TIM8_SR status register **/
#define TIM8_SR			MMIO32(TIM8_BASE + 0x10)
/** TIM8_EGR event generation register **/
#define TIM8_EGR			MMIO32(TIM8_BASE + 0x14)
/** TIM8_CCMR1_Output capture/compare mode register 1 (output mode) **/
#define TIM8_CCMR1_Output			MMIO32(TIM8_BASE + 0x18)
/** TIM8_CCMR1_Input capture/compare mode register 1 (input mode) **/
#define TIM8_CCMR1_Input			MMIO32(TIM8_BASE + 0x18)
/** TIM8_CCMR2_Output capture/compare mode register 2 (output mode) **/
#define TIM8_CCMR2_Output			MMIO32(TIM8_BASE + 0x1c)
/** TIM8_CCMR2_Input capture/compare mode register 2 (input mode) **/
#define TIM8_CCMR2_Input			MMIO32(TIM8_BASE + 0x1c)
/** TIM8_CCER capture/compare enable register **/
#define TIM8_CCER			MMIO32(TIM8_BASE + 0x20)
/** TIM8_CNT counter **/
#define TIM8_CNT			MMIO32(TIM8_BASE + 0x24)
/** TIM8_PSC prescaler **/
#define TIM8_PSC			MMIO32(TIM8_BASE + 0x28)
/** TIM8_ARR auto-reload register **/
#define TIM8_ARR			MMIO32(TIM8_BASE + 0x2c)
/** TIM8_RCR repetition counter register **/
#define TIM8_RCR			MMIO32(TIM8_BASE + 0x30)
/** TIM8_CCR1 capture/compare register 1 **/
#define TIM8_CCR1			MMIO32(TIM8_BASE + 0x34)
/** TIM8_CCR2 capture/compare register 2 **/
#define TIM8_CCR2			MMIO32(TIM8_BASE + 0x38)
/** TIM8_CCR3 capture/compare register 3 **/
#define TIM8_CCR3			MMIO32(TIM8_BASE + 0x3c)
/** TIM8_CCR4 capture/compare register 4 **/
#define TIM8_CCR4			MMIO32(TIM8_BASE + 0x40)
/** TIM8_BDTR break and dead-time register **/
#define TIM8_BDTR			MMIO32(TIM8_BASE + 0x44)
/** TIM8_DCR DMA control register **/
#define TIM8_DCR			MMIO32(TIM8_BASE + 0x48)
/** TIM8_DMAR DMA address for full transfer **/
#define TIM8_DMAR			MMIO32(TIM8_BASE + 0x4c)
/** TIM8_CCMR3_Output capture/compare mode register 3 (output mode) **/
#define TIM8_CCMR3_Output			MMIO32(TIM8_BASE + 0x54)
/** TIM8_CCR5 capture/compare register 5 **/
#define TIM8_CCR5			MMIO32(TIM8_BASE + 0x58)
/** TIM8_CRR6 capture/compare register 6 **/
#define TIM8_CRR6			MMIO32(TIM8_BASE + 0x5c)
/** TIM8_AF1 TIM1 alternate function option register 1 **/
#define TIM8_AF1			MMIO32(TIM8_BASE + 0x60)
/** TIM8_AF2 TIM1 Alternate function odfsdm1_breakster 2 **/
#define TIM8_AF2			MMIO32(TIM8_BASE + 0x64)
/** TIM8_TISEL TIM1 timer input selection register **/
#define TIM8_TISEL			MMIO32(TIM8_BASE + 0x68)

/**@}*/


/** @defgroup tim8_cr1 CR1 control register 1
@{*/

/** TIM8_CR1_UIFREMAP UIF status bit remapping **/
#define TIM8_CR1_UIFREMAP		(1 << 11)

#define TIM8_CR1_CKD_SHIFT		8
#define TIM8_CR1_CKD_MASK		0x03
/** @defgroup tim8_cr1_ckd CKD Clock division
@{*/
/**@}*/

/** TIM8_CR1_ARPE Auto-reload preload enable **/
#define TIM8_CR1_ARPE		(1 << 7)

#define TIM8_CR1_CMS_SHIFT		5
#define TIM8_CR1_CMS_MASK		0x03
/** @defgroup tim8_cr1_cms CMS Center-aligned mode selection
@{*/
/**@}*/

/** TIM8_CR1_DIR Direction **/
#define TIM8_CR1_DIR		(1 << 4)
/** TIM8_CR1_OPM One-pulse mode **/
#define TIM8_CR1_OPM		(1 << 3)
/** TIM8_CR1_URS Update request source **/
#define TIM8_CR1_URS		(1 << 2)
/** TIM8_CR1_UDIS Update disable **/
#define TIM8_CR1_UDIS		(1 << 1)
/** TIM8_CR1_CEN Counter enable **/
#define TIM8_CR1_CEN		(1 << 0)

/**@}*/

/** @defgroup tim8_cr2 CR2 control register 2
@{*/


#define TIM8_CR2_MMS2_SHIFT		20
#define TIM8_CR2_MMS2_MASK		0x0f
/** @defgroup tim8_cr2_mms2 MMS2 Master mode selection 2
@{*/
/**@}*/

/** TIM8_CR2_OIS6 Output Idle state 6 **/
#define TIM8_CR2_OIS6		(1 << 18)
/** TIM8_CR2_OIS5 Output Idle state 5 **/
#define TIM8_CR2_OIS5		(1 << 16)
/** TIM8_CR2_OIS4 Output Idle state 4 **/
#define TIM8_CR2_OIS4		(1 << 14)
/** TIM8_CR2_OIS3N Output Idle state 3 **/
#define TIM8_CR2_OIS3N		(1 << 13)
/** TIM8_CR2_OIS3 Output Idle state 3 **/
#define TIM8_CR2_OIS3		(1 << 12)
/** TIM8_CR2_OIS2N Output Idle state 2 **/
#define TIM8_CR2_OIS2N		(1 << 11)
/** TIM8_CR2_OIS2 Output Idle state 2 **/
#define TIM8_CR2_OIS2		(1 << 10)
/** TIM8_CR2_OIS1N Output Idle state 1 **/
#define TIM8_CR2_OIS1N		(1 << 9)
/** TIM8_CR2_OIS1 Output Idle state 1 **/
#define TIM8_CR2_OIS1		(1 << 8)
/** TIM8_CR2_TI1S TI1 selection **/
#define TIM8_CR2_TI1S		(1 << 7)

#define TIM8_CR2_MMS_SHIFT		4
#define TIM8_CR2_MMS_MASK		0x07
/** @defgroup tim8_cr2_mms MMS Master mode selection
@{*/
/**@}*/

/** TIM8_CR2_CCDS Capture/compare DMA selection **/
#define TIM8_CR2_CCDS		(1 << 3)
/** TIM8_CR2_CCUS Capture/compare control update selection **/
#define TIM8_CR2_CCUS		(1 << 2)
/** TIM8_CR2_CCPC Capture/compare preloaded control **/
#define TIM8_CR2_CCPC		(1 << 0)

/**@}*/

/** @defgroup tim8_smcr SMCR slave mode control register
@{*/


#define TIM8_SMCR_TS_4_3_SHIFT		20
#define TIM8_SMCR_TS_4_3_MASK		0x03
/** @defgroup tim8_smcr_ts_4_3 TS43 Trigger selection - bit 4:3
@{*/
/**@}*/

/** TIM8_SMCR_SMS_3 Slave mode selection - bit 3 **/
#define TIM8_SMCR_SMS_3		(1 << 16)
/** TIM8_SMCR_ETP External trigger polarity **/
#define TIM8_SMCR_ETP		(1 << 15)
/** TIM8_SMCR_ECE External clock enable **/
#define TIM8_SMCR_ECE		(1 << 14)

#define TIM8_SMCR_ETPS_SHIFT		12
#define TIM8_SMCR_ETPS_MASK		0x03
/** @defgroup tim8_smcr_etps ETPS External trigger prescaler
@{*/
/**@}*/


#define TIM8_SMCR_ETF_SHIFT		8
#define TIM8_SMCR_ETF_MASK		0x0f
/** @defgroup tim8_smcr_etf ETF External trigger filter
@{*/
/**@}*/

/** TIM8_SMCR_MSM Master/Slave mode **/
#define TIM8_SMCR_MSM		(1 << 7)

#define TIM8_SMCR_TS_SHIFT		4
#define TIM8_SMCR_TS_MASK		0x07
/** @defgroup tim8_smcr_ts TS Trigger selection
@{*/
/**@}*/


#define TIM8_SMCR_SMS_SHIFT		0
#define TIM8_SMCR_SMS_MASK		0x07
/** @defgroup tim8_smcr_sms SMS Slave mode selection
@{*/
/**@}*/


/**@}*/

